# GetCableSectionsCnt

## Description
Get the count of cable sections in the cable.

```pascal
FUNCTION GetCableSectionsCnt(hObj : HANDLE) : INTEGER;
```

```python

def vs.GetCableSectionsCnt(hObj):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||

## Version
Availability: from Vectorworks 2025.4
## Category
* Objects - Cables